<?php

$cvGlobalSpecials = [
  'client-web-app'    => 'ওয়েব এপ্লিকেশনের মাধ্যমে টোকেন অনুরোধের অনুমতি',
  'client-mobile-app' => 'মোবাইল এপ্লিকেশনের মাধ্যমে টোকেন অনুরোধের অনুমতি',
  'code-hooks'        => 'কোডে হুক ব্যবহারের অনুমতি',
  'inactives'         => 'নিষ্ক্রিয় অ্যাক্সেসের অনুমতি',
];

$cvSections =  [
  'additionals' => 'অতিরিক্ত',
  'catalogs'    => 'ক্যাটালগ',
  'dashboard'   => 'ড্যাশবোর্ড',
  'files'       => 'ফাইল',
  'main'        => 'মুখ্য',
  'profile'     => 'প্রোফাইল',
  'security'    => 'নিরাপত্তা',
  'settings'    => 'সেটিংস',
];

$cvActions = [
  'index'  => [
    'call_message'   =>'তালিকা',
    'called_message' =>'তালিকা',
    'for'            =>'(এপিআই এবং ক্লায়েন্ট)',
  ],

  'show'   => [
    'call_message'   =>'দেখুন',
    'called_message' =>'দেখুন',
    'for'            =>'(এপিআই এবং ক্লায়েন্ট)',
  ],

  'create' => [
    'call_message'   =>'তৈরি দেখুন',
    'called_message' =>'তৈরি করা হচ্ছে',
    'next_message'   =>'সংরক্ষণ করুন',
    'success'        =>'তৈরি হয়েছে',
    'for'            =>'(ক্লায়েন্ট)',
  ],

  'add' => [
    'call_message'   =>'যোগ করুন',
    'called_message' =>'যোগ করা হচ্ছে',
    'success'        =>'যোগ করা হয়েছে',
    'for'            =>'(এপিআই এবং ক্লায়েন্ট)',
  ],

  'store'  => [
    'call_message'   =>'তৈরি করুন',
    'called_message' =>'তৈরি করা হচ্ছে',
    'success'        =>'তৈরি হয়েছে',
    'for'            =>'(এপিআই)',
  ],

  'edit'   => [
    'call_message'   =>'সম্পাদনা দেখুন',
    'called_message' =>'সম্পাদনা হচ্ছে',
    'next_message'   =>'আপডেট করুন',
    'for'            =>'(ক্লায়েন্ট)',
  ],

  'update' => [
    'call_message'   =>'আপডেট করুন',
    'called_message' =>'আপডেট করা হচ্ছে',
    'success'        =>'আপডেট হয়েছে',
    'for'            =>'(এপিআই)',
  ],

  'delete' => [
    'call_message'       =>'মুছে ফেলার দেখুন',
    'success'            =>'মুছে ফেলা হয়েছে',
    'confirmation_alert' =>'রেকর্ডটি মুছে ফেলা হবে',
    'for'                =>'(ক্লায়েন্ট)',
  ],

  'destroy' => [
    'call_message'       =>'মুছে ফেলুন',
    'success'            =>'মুছে ফেলা হয়েছে',
    'confirmation_alert' =>'রেকর্ডটি মুছে ফেলা হবে',
    'for'                =>'(এপিআই)',
  ],

  'activate' => [
    'call_message' =>'সক্রিয় করুন',
    'success'      =>'সফলভাবে সক্রিয় করা হয়েছে',
    'for'          =>'(এপিআই এবং ক্লায়েন্ট)',
  ],

  'deactivate' => [
    'call_message' =>'নিষ্ক্রিয় করুন',
    'success'      =>'সফলভাবে নিষ্ক্রিয় করা হয়েছে',
    'for'          =>'(এপিআই এবং ক্লায়েন্ট)',
  ],

  'import' => [
    'call_message'   =>'আমদানি দেখুন',
    'called_message' =>'আমদানি করা হচ্ছে',
    'main_label'     =>'আমদানি করার জন্য ফাইল (এক্সেল)',
    'next_message'   =>'আমদানি করুন',
    'for'            =>'(ক্লায়েন্ট)',
  ],

  'importing' => [
    'call_message'   =>'আমদানি করুন',
    'success'        =>'সফলভাবে আমদানি করা হয়েছে',
    'for'            =>'(এপিআই)',
  ],

  'export' => [
    'call_message'   =>'পর্যাপ্ত দেখুন',
    'called_message' =>'পর্যাপ্ত করা হচ্ছে',
    'next_message'   =>'পর্যাপ্ত এক্সপোর্ট এক্সেল তৈরি করুন',
    'success'        =>'সফলভাবে পর্যাপ্ত হয়েছে',
    'for'            =>'(ক্লায়েন্ট)',
  ],

  'exporting' => [
    'call_message'   =>'পর্যাপ্ত দেখুন',
    'called_message' =>'পর্যাপ্ত করা হচ্ছে',
    'next_message'   =>'পর্যাপ্ত এক্সপোর্ট এক্সেল তৈরি করুন',
    'success'        =>'সফলভাবে পর্যাপ্ত হয়েছে',
    'for'            =>'(এপিআই)',
  ],

  'exportings' => [
    'call_message'   =>'সম্পূর্ণ পর্যাপ্ত দেখুন',
    'called_message' =>'সম্পূর্ণ পর্যাপ্ত করা হচ্ছে',
    'next_message'   =>'সম্পূর্ণ পর্যাপ্ত এক্সপোর্ট এক্সেল তৈরি করুন',
    'success'        =>'সম্পূর্ণ সফলভাবে পর্যাপ্ত হয়েছে',
    'for'            =>'(এপিআই)',
  ],

  'relatedIndex' => [
    'call_message'   =>'সম্পর্ককারী',
    'called_message' =>'সম্পর্ককারী',
    'next_message'   =>'সম্পর্কিত সংরক্ষণ করুন',
    'success'        =>'সংশ্লিষ্ট রেকর্ড',
    'for'            =>'(এপিআই এবং ক্লায়েন্ট)',
  ],

  'indexOwnedBy' => [
    'call_message'   =>'রেকর্ডের মালিক',
    'called_message' =>'সম্পর্ককারী',
    'next_message'   =>'সম্পর্কিত সংরক্ষণ করুন',
    'success'        =>'সংশ্লিষ্ট রেকর্ড',
    'for'            =>'(এপিআই এবং ক্লায়েন্ট)',
  ],

  'sluged' => [
    'call_message'   =>'স্লাগ দ্বারা তালিকা',
    'called_message' =>'স্লাগ দ্বারা তালিকা পেতে',
    'for'            =>'(এপিআই এবং ক্লায়েন্ট)',
  ],
  'unauthorized' => [
    'call_message'   =>'অনুমতি বাধান লোড করুন',
    'called_message' =>'অনুমতি বাধান লোড করা হচ্ছে',
    'for'            =>'(এপিআই এবং ক্লায়েন্ট)',
  ],

  'permissions' => [
    'call_message'   =>'রোল দ্বারা অনুমতি লোড করুন',
    'called_message' =>'রোল দ্বারা অনুমতি লোড করা হচ্ছে',
    'for'            =>'(এপিআই এবং ক্লায়েন্ট)',
  ],

  'roles' => [
    'call_message'   =>'ব্যবহারকারী দ্বারা ভূমিকা লোড করুন',
    'called_message' =>'ব্যবহারকারী দ্বারা ভূমিকা লোড করা হচ্ছে',
    'for'            =>'(এপিআই এবং ক্লায়েন্ট)',
  ],

  'profile' => [
    'call_message'   =>'ব্যবহারকারী তথ্য লোড করুন',
    'called_message' =>'ব্যবহারকারী তথ্য লোড করা হচ্ছে',
    'for'            =>'(এপিআই এবং ক্লায়েন্ট)',
  ],

  'logout' => [
    'call_message'   =>'লগআউট',
    'called_message' =>'লগআউট হচ্ছে',
    'next_message'   =>'লগআউট',
    'success'        =>'লগআউট হয়েছে',
    'for'            =>'(এপিআই এবং ক্লায়েন্ট)',
  ],

  'updateProfile' => [
    'call_message'   =>'ব্যবহারকারী তথ্য আপডেট করুন',
    'called_message' =>'ব্যবহারকারী তথ্য আপডেট হচ্ছে',
    'next_message'   =>'ব্যবহারকারী তথ্য আপডেট করুন',
    'success'        =>'ব্যবহারকারী তথ্য সফলভাবে আপডেট হয়েছে',
    'for'            =>'(এপিআই এবং ক্লায়েন্ট)',
  ],

  'dashboardInfo' => [
    'call_message'   =>'প্রশাসনিক তথ্য লোড করুন',
    'called_message' =>'প্রশাসনিক তথ্য লোড করা হচ্ছে',
    'for'            =>'(এপিআই এবং ক্লায়েন্ট)',
  ],

  'resources' => [
    'call_message'   =>'সংশ্লিষ্ট সম্পদ অনুভব করুন',
    'called_message' =>'সংশ্লিষ্ট সম্পদ অনুভব করা হচ্ছে',
    'for'            =>'(এপিআই.ক্লায়েন্ট)',
  ],

  'resourcer' => [
    'call_message'   =>'সম্পদের ফাইল পেতে',
    'called_message' =>'সম্পদের ফাইল পেতে',
    'for'            =>'(এপিআই.ক্লায়েন্ট)',
  ],

  'register' => [
    'call_message'   =>'রেজিস্টার করুন',
    'called_message' =>'রেজিস্ট্রেশন করা হচ্ছে',
    'success'        =>'রেজিস্ট্রেশন হয়েছে',
    'for'            =>'(এপিআই এবং ক্লায়েন্ট)',
  ],

  'recovery' => [
    'call_message'   =>'পুনরুদ্ধার করুন',
    'called_message' =>'পুনরুদ্ধার করা হচ্ছে',
    'success'        =>'পুনরুদ্ধার হয়েছে',
    'for'            =>'(এপিআই এবং ক্লায়েন্ট)',
  ],

  'storeUpdate'  => [
    'call_message'   =>'তৈরি বা সম্পাদনা করুন',
    'called_message' =>'তৈরি বা সম্পাদনা হচ্ছে',
    'success'        =>'সফলভাবে সম্পাদনা হয়েছে',
    'for'            =>'(এপিআই)',
  ],

  'zippedResource' => [
    'call_message'   => 'জিপ করা সম্পদের ফাইল ডাউনলোড করুন',
    'called_message' => 'জিপ করা সম্পদের ফাইল ডাউনলোড করা হচ্ছে',
    'success'        => 'সফলভাবে জিপ করা সম্পদের ফাইল ডাউনলোড হয়েছে',
    'for'            => '(এপিআই এবং ক্লায়েন্ট)',
  ],
];

$cvSpecials=[
  'inactives'            => 'নিষ্ক্রিয়',
  'general-owner'        => 'সাধারণ মালিক',
  'particular-owner'     => 'ব্যক্তিগত মালিক',
  'files-settings'       => 'সম্পদের ফাইল সেটিংস',
  'index-files'          => 'সম্পদের ফাইল তালিকা',
  'show-files'           => 'সম্পদের ফাইল দেখুন',
  'create-files'         => 'সম্পদের ফাইল তৈরি দেখুন',
  'store-files'          => 'সম্পদের ফাইল তৈরি করুন',
  'edit-files'           => 'সম্পদের ফাইল সম্পাদনা দেখুন',
  'update-files'         => 'সম্পদের ফাইল আপডেট করুন',
  'delete-files'         => 'সম্পদের ফাইল মুছে ফেলার দেখুন',
  'destroy-files'        => 'সম্পদের ফাইল মুছে ফেলুন',
  'zippedResource-files' => 'জিপ করা সম্পদের ফাইল ডাউনলোড করুন',
  'code-hooks'           => 'কোড হুক সেট করুন',
];

$cvActionsExtra = [
  'common'=>[
    'cancel'    => 'বাতিল',
    'back'      => 'পেছনে যান',
    'confirm'   => 'আপনি কি নিশ্চিত?',
    'correctly' => 'সঠিকভাবে',
    'of'        => 'এর',
  ],

  'label'=>'অ্যাকশন',

  'status'=>[
    'yes' =>'হ্যাঁ',
    'no'  =>'না',
  ],
];

$cvCrudvel = [
  'context_permission'=>'অনুমতি প্রয়োগ করে',
];

$cvWeb = [
  'unauthorized'         => 'আপনি এই অ্যাকশন সম্পাদন করতে অনুমতি আছে না',
  'has_no_permsissions' => 'আপনি এই অ্যাকশন সম্পাদন করতে অনুমতি আছে না',
  'operation_error'     => 'অপারেশনটি সম্পাদন করা যায়নি, পরে চেষ্টা করুন',
  'transaction-error'   => 'লেনদেন সম্পাদন করতে সময় দিতে সমস্যা হয়েছে',
  'success'             => 'অ্যাকশন সম্পাদন হয়েছে',
  'not_found'           => 'সম্পদ পাওয়া যায়নি',
  'error'               => 'অপ্রত্যাশিত ত্রুটি ঘটেছে',
  'file_error'          => 'ফাইলে অ্যাক্সেস করার চেষ্টা করতে সমস্যা হয়েছে',
  'already_exist'       => 'ইতিমধ্যে নিবন্ধিত হয়েছে',
  'validation_errors'   => 'সত্যাপন সফল হয়নি',
];

$cvApi = [
  'unauthorized'           => 'আপনি এই অ্যাকশন সম্পাদন করতে অনুমতি আছে না',
  'has_no_permsissions'   => 'আপনি এই অ্যাকশন সম্পাদন করতে অনুমতি আছে না',
  'operation_error'       => 'অপারেশনটি সম্পাদন করা যায়নি, পরে চেষ্টা করুন',
  'transaction-error'     => 'লেনদেন সম্পাদন করতে সময় দিতে সমস্যা হয়েছে',
  'not_found'             => 'সম্পদ পাওয়া যায়নি',
  'error'                 => 'অপ্রত্যাশিত ত্রুটি ঘটেছে',
  'file_error'            => 'ফাইলে অ্যাক্সেস করার চেষ্টা করতে সমস্যা হয়েছে',
  'already_exist'         => 'ইতিমধ্যে নিবন্ধিত হয়েছে',
  'validation_errors'     => 'সত্যাপন সফল হয়নি',
  'logget_out'            => 'আপনি সেইসাথে সাইন আউট হয়েছেন',
  'success'               => 'অ্যাকশন সম্পাদন হয়েছে',
  'incomplete'            => 'অ্যাকশন অসম্পূর্ণ',
  'bad_paginate_petition' => 'পৃষ্ঠাবিহীন স্তম্ভের প্যারামিটার, ডিফল্ট মান দিয়ে প্রতিউত্তর দিন',
  'unproccesable'         => 'অসমঞ্জায়িত তথ্য',
  'miss_configuration'    => 'সঠিকভাবে কনফিগার সেবা',
  'true'                  => 'সত্য',
  'false'                 => 'মিথ্যা',
  'no_files_to_zip'       => 'সম্পদের জন্য কোনও ফাইল নেই',
  'no_cache_property'     => 'একটি বৈশিষ্ট্যে অ্যাক্সেস করতে সমস্যা হয়েছে',
];
